move ditaa to mermaid -- WIP
